; domain
(define (domain cluster-actions)
  (:requirements :strips :equality :action-costs)
  (:types
    action-t section-t obj-t head-t - object
    obj-right-t obj-left-t - obj-t
  )
  (:constants
    pre add del - section-t
    action-left action-right - action-t
  )
  (:predicates
    (same-name ?obj-left - obj-left-t ?obj-right - obj-right-t)
    (matched ?o0 - obj-left-t ?o1 - obj-right-t)
    (unmatched ?o - obj-t)

    (atom-0 ?act - action-t ?sec - section-t ?h - head-t)
    (atom-1 ?act - action-t ?sec - section-t ?h - head-t ?o0 - obj-t)
    (atom-2 ?act - action-t ?sec - section-t ?h - head-t ?o0 ?o1 - obj-t)
    (atom-3 ?act - action-t ?sec - section-t ?h - head-t ?o0 ?o1 ?o2 - obj-t)

    (processed-atom-0 ?act - action-t ?sec - section-t ?h - head-t)
    (processed-atom-1 ?act - action-t ?sec - section-t ?h - head-t ?o0 - obj-t)
    (processed-atom-2 ?act - action-t ?sec - section-t ?h - head-t ?o0 ?o1 - obj-t)
    (processed-atom-3 ?act - action-t ?sec - section-t ?h - head-t ?o0 ?o1 ?o2 - obj-t)

    (taken-atom-0 ?act - action-t ?sec - section-t ?h - head-t)
    (taken-atom-1 ?act - action-t ?sec - section-t ?h - head-t ?o0 - obj-t)
    (taken-atom-2 ?act - action-t ?sec - section-t ?h - head-t ?o0 ?o1 - obj-t)
    (taken-atom-3 ?act - action-t ?sec - section-t ?h - head-t ?o0 ?o1 ?o2 - obj-t)

    (discarded-atom-0 ?act - action-t ?sec - section-t ?h - head-t)
    (discarded-atom-1 ?act - action-t ?sec - section-t ?h - head-t ?o0 - obj-t)
    (discarded-atom-2 ?act - action-t ?sec - section-t ?h - head-t ?o0 ?o1 - obj-t)
    (discarded-atom-3 ?act - action-t ?sec - section-t ?h - head-t ?o0 ?o1 ?o2 - obj-t)
  )
  (:functions
    (total-cost)
  )

  (:action match-same-name
   :parameters (?o0 - obj-left-t
                ?o1 - obj-right-t)
   :precondition (and
      (unmatched ?o0)
      (unmatched ?o1)
      (same-name ?o0 ?o1)
   )
   :effect (and
      (matched ?o0 ?o0)
      (not (unmatched ?o0))
      (not (unmatched ?o1))
      ;(increase (total-cost) 1)
   )
  )

  (:action match
   :parameters (?o0 - obj-left-t
                ?o1 - obj-right-t)
   :precondition (and
      (unmatched ?o0)
      (unmatched ?o1)
   )
   :effect (and
      (matched ?o0 ?o1)
      (not (unmatched ?o0))
      (not (unmatched ?o1))
      (increase (total-cost) 10)
   )
  )

  (:action discard-atom-0
   :parameters (?act - action-t
                ?sec - section-t
                ?h - head-t)
   :precondition (atom-0 ?act ?sec ?h)
   :effect (and
      (processed-atom-0 ?act ?sec ?h)
      (discarded-atom-0 ?act ?sec ?h)
      (increase (total-cost) 100)
   )
  )

  (:action discard-atom-1
   :parameters (?act - action-t
                ?sec - section-t
                ?h - head-t
                ?o0 - obj-t)
   :precondition (atom-1 ?act ?sec ?h ?o0)
   :effect (and
      (processed-atom-1 ?act ?sec ?h ?o0)
      (discarded-atom-1 ?act ?sec ?h ?o0)
      (increase (total-cost) 100)
   )
  )

  (:action discard-atom-2
   :parameters (?act - action-t
                ?sec - section-t
                ?h - head-t ?o0
                ?o1 - obj-t)
   :precondition (atom-2 ?act ?sec ?h ?o0 ?o1)
   :effect (and
      (processed-atom-2 ?act ?sec ?h ?o0 ?o1)
      (discarded-atom-2 ?act ?sec ?h ?o0 ?o1)
      (increase (total-cost) 100)
   )
  )

  (:action discard-atom-3
   :parameters (?act - action-t
                ?sec - section-t
                ?h - head-t
                ?o0 ?o1 ?o2 - obj-t)
   :precondition (atom-3 ?act ?sec ?h ?o0 ?o1 ?o2)
   :effect (and
      (processed-atom-3 ?act ?sec ?h ?o0 ?o1 ?o2)
      (discarded-atom-3 ?act ?sec ?h ?o0 ?o1 ?o2)
      (increase (total-cost) 100)
   )
  )

  (:action take-atom-0
   :parameters (?sec - section-t
                ?h - head-t)
   :precondition (and
      (atom-0 action-left ?sec ?h)
      (atom-0 action-right ?sec ?h)
   )
   :effect (and
      (processed-atom-0 action-left ?sec ?h)
      (processed-atom-0 action-right ?sec ?h)
      (taken-atom-0 action-left ?sec ?h)
      (taken-atom-0 action-right ?sec ?h)
   )
  )

  (:action take-atom-1
   :parameters (?sec - section-t
                ?h - head-t
                ?o0-left - obj-left-t
                ?o0-right - obj-right-t)
   :precondition (and
      (atom-1 action-left ?sec ?h ?o0-left)
      (atom-1 action-right ?sec ?h ?o0-right)
      (matched ?o0-left ?o0-right)
   )
   :effect (and
      (processed-atom-1 action-left ?sec ?h ?o0-left)
      (processed-atom-1 action-right ?sec ?h ?o0-right)
      (taken-atom-1 action-left ?sec ?h ?o0-left)
      (taken-atom-1 action-right ?sec ?h ?o0-right)
   )
  )

  (:action take-atom-2
   :parameters (?sec - section-t
                ?h - head-t
                ?o0-left ?o1-left - obj-left-t
                ?o0-right ?o1-right - obj-right-t)
   :precondition (and
      (atom-2 action-left ?sec ?h ?o0-left ?o1-left)
      (atom-2 action-right ?sec ?h ?o0-right ?o1-right)
      (matched ?o0-left ?o0-right)
      (matched ?o1-left ?o1-right)
   )
   :effect (and
      (processed-atom-2 action-left ?sec ?h ?o0-left ?o1-left)
      (processed-atom-2 action-right ?sec ?h ?o0-right ?o1-right)
      (taken-atom-2 action-left ?sec ?h ?o0-left ?o1-left)
      (taken-atom-2 action-right ?sec ?h ?o0-right ?o1-right)
   )
  )

  (:action take-atom-3
   :parameters (?sec - section-t
                ?h - head-t
                ?o0-left ?o1-left ?o2-left - obj-left-t
                ?o0-right ?o1-right ?o2-right - obj-right-t)
   :precondition (and
      (atom-3 action-left ?sec ?h ?o0-left ?o1-left ?o2-left)
      (atom-3 action-right ?sec ?h ?o0-right ?o1-right ?o2-right)
      (matched ?o0-left ?o0-right)
      (matched ?o1-left ?o1-right)
      (matched ?o2-left ?o2-right)
   )
   :effect (and
      (processed-atom-3 action-left ?sec ?h ?o0-left ?o1-left ?o2-left)
      (processed-atom-3 action-right ?sec ?h ?o0-right ?o1-right ?o2-right)
      (taken-atom-3 action-left ?sec ?h ?o0-left ?o1-left ?o2-left)
      (taken-atom-3 action-right ?sec ?h ?o0-right ?o1-right ?o2-right)
   )
  )
)

; problem
(define (problem p0)
  (:domain cluster-actions)
  (:objects
    l-loc-1-1 l-loc-1-2 l-loc-2-1 l-loc-2-2 l-left l-up l-right l-down - obj-left-t
    r-loc-1-1 r-loc-1-2 r-loc-2-1 r-loc-2-2 r-left r-up r-right r-down - obj-right-t
    adj at - head-t
  )
  (:init
    (= (total-cost) 0)

    (same-name l-loc-1-1 r-loc-1-1)
    (same-name l-loc-1-2 r-loc-1-2)
    (same-name l-loc-2-1 r-loc-2-1)
    (same-name l-loc-2-2 r-loc-2-2)
    (same-name l-left r-left)
    (same-name l-up r-up)
    (same-name l-right r-right)
    (same-name l-down r-down)

    (unmatched l-loc-1-1)
    (unmatched l-loc-1-2)
    (unmatched l-loc-2-1)
    (unmatched l-loc-2-2)
    (unmatched l-left)
    (unmatched l-up)
    (unmatched l-right)
    (unmatched l-down)

    (unmatched r-loc-1-1)
    (unmatched r-loc-1-2)
    (unmatched r-loc-2-1)
    (unmatched r-loc-2-2)
    (unmatched r-left)
    (unmatched r-up)
    (unmatched r-right)
    (unmatched r-down)

    ; action-left precondition 
    (atom-1 action-left pre at l-loc-1-1)
    (atom-3 action-left pre adj l-loc-1-1 l-loc-1-2 l-right)
    (atom-3 action-left pre adj l-loc-1-2 l-loc-1-1 l-left)
    (atom-3 action-left pre adj l-loc-1-1 l-loc-2-1 l-down)
    (atom-3 action-left pre adj l-loc-2-1 l-loc-1-1 l-up)
    (atom-3 action-left pre adj l-loc-1-2 l-loc-2-2 l-down)
    (atom-3 action-left pre adj l-loc-2-2 l-loc-1-2 l-up)
    (atom-3 action-left pre adj l-loc-2-1 l-loc-2-2 l-right)
    (atom-3 action-left pre adj l-loc-2-2 l-loc-2-1 l-left)
    ; action-left add
    (atom-1 action-left add at l-loc-1-2)
    ; action-right del
    (atom-1 action-left del at l-loc-1-1)

    ; action-right precondition 
    (atom-1 action-right pre at r-loc-1-2)
    (atom-3 action-right pre adj r-loc-1-1 r-loc-1-2 r-right)
    (atom-3 action-right pre adj r-loc-1-2 r-loc-1-1 r-left)
    (atom-3 action-right pre adj r-loc-1-1 r-loc-2-1 r-down)
    (atom-3 action-right pre adj r-loc-2-1 r-loc-1-1 r-up)
    (atom-3 action-right pre adj r-loc-1-2 r-loc-2-2 r-down)
    (atom-3 action-right pre adj r-loc-2-2 r-loc-1-2 r-up)
    (atom-3 action-right pre adj r-loc-2-1 r-loc-2-2 r-right)
    (atom-3 action-right pre adj r-loc-2-2 r-loc-2-1 r-left)
    ; action-right add
    (atom-1 action-right add at r-loc-2-2)
    ; action-right del
    (atom-1 action-right del at r-loc-1-2)
  )
  (:goal
    (and
      ; action-left precondition 
      (processed-atom-1 action-left pre at l-loc-1-1)
      (processed-atom-3 action-left pre adj l-loc-1-1 l-loc-1-2 l-right)
      (processed-atom-3 action-left pre adj l-loc-1-2 l-loc-1-1 l-left)
      (processed-atom-3 action-left pre adj l-loc-1-1 l-loc-2-1 l-down)
      (processed-atom-3 action-left pre adj l-loc-2-1 l-loc-1-1 l-up)
      (processed-atom-3 action-left pre adj l-loc-1-2 l-loc-2-2 l-down)
      (processed-atom-3 action-left pre adj l-loc-2-2 l-loc-1-2 l-up)
      (processed-atom-3 action-left pre adj l-loc-2-1 l-loc-2-2 l-right)
      (processed-atom-3 action-left pre adj l-loc-2-2 l-loc-2-1 l-left)
      ; action-left add
      (taken-atom-1 action-left add at l-loc-1-2)
      ; action-right del
      (taken-atom-1 action-left del at l-loc-1-1)

      ; action-right precondition 
      (processed-atom-1 action-right pre at r-loc-1-2)
      (processed-atom-3 action-right pre adj r-loc-1-1 r-loc-1-2 r-right)
      (processed-atom-3 action-right pre adj r-loc-1-2 r-loc-1-1 r-left)
      (processed-atom-3 action-right pre adj r-loc-1-1 r-loc-2-1 r-down)
      (processed-atom-3 action-right pre adj r-loc-2-1 r-loc-1-1 r-up)
      (processed-atom-3 action-right pre adj r-loc-1-2 r-loc-2-2 r-down)
      (processed-atom-3 action-right pre adj r-loc-2-2 r-loc-1-2 r-up)
      (processed-atom-3 action-right pre adj r-loc-2-1 r-loc-2-2 r-right)
      (processed-atom-3 action-right pre adj r-loc-2-2 r-loc-2-1 r-left)
      ; action-right add
      (taken-atom-1 action-right add at r-loc-2-2)
      ; action-right del
      (taken-atom-1 action-right del at r-loc-1-2)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (match l-up r-right)
   deleted: (unmatched l-up) (unmatched r-right)
   added: (matched l-up r-right)
   goals met: 0 of 22
2. (match l-down r-left)
   deleted: (unmatched l-down) (unmatched r-left)
   added: (matched l-down r-left)
   goals met: 0 of 22
3. (match l-right r-down)
   deleted: (unmatched l-right) (unmatched r-down)
   added: (matched l-right r-down)
   goals met: 0 of 22
4. (match l-left r-up)
   deleted: (unmatched l-left) (unmatched r-up)
   added: (matched l-left r-up)
   goals met: 0 of 22
5. (match l-loc-1-1 r-loc-1-2)
   deleted: (unmatched l-loc-1-1) (unmatched r-loc-1-2)
   added: (matched l-loc-1-1 r-loc-1-2)
   goals met: 0 of 22
6. (match l-loc-2-1 r-loc-1-1)
   deleted: (unmatched l-loc-2-1) (unmatched r-loc-1-1)
   added: (matched l-loc-2-1 r-loc-1-1)
   goals met: 0 of 22
7. (match l-loc-1-2 r-loc-2-2)
   deleted: (unmatched l-loc-1-2) (unmatched r-loc-2-2)
   added: (matched l-loc-1-2 r-loc-2-2)
   goals met: 0 of 22
8. (match l-loc-2-2 r-loc-2-1)
   deleted: (unmatched l-loc-2-2) (unmatched r-loc-2-1)
   added: (matched l-loc-2-2 r-loc-2-1)
   goals met: 0 of 22
9. (take-atom-3 pre adj l-loc-1-1 l-loc-2-1 l-down r-loc-1-2 r-loc-1-1 r-left)
   added: (processed-atom-3 action-left pre adj l-loc-1-1 l-loc-2-1 l-down) (processed-atom-3 action-right pre adj r-loc-1-2 r-loc-1-1 r-left) (taken-atom-3 action-left pre adj l-loc-1-1 l-loc-2-1 l-down) (taken-atom-3 action-right pre adj r-loc-1-2 r-loc-1-1 r-left)
   goals met: 2 of 22
10. (take-atom-3 pre adj l-loc-1-2 l-loc-2-2 l-down r-loc-2-2 r-loc-2-1 r-left)
   added: (processed-atom-3 action-left pre adj l-loc-1-2 l-loc-2-2 l-down) (processed-atom-3 action-right pre adj r-loc-2-2 r-loc-2-1 r-left) (taken-atom-3 action-left pre adj l-loc-1-2 l-loc-2-2 l-down) (taken-atom-3 action-right pre adj r-loc-2-2 r-loc-2-1 r-left)
   goals met: 4 of 22
11. (take-atom-3 pre adj l-loc-1-2 l-loc-1-1 l-left r-loc-2-2 r-loc-1-2 r-up)
   added: (processed-atom-3 action-left pre adj l-loc-1-2 l-loc-1-1 l-left) (processed-atom-3 action-right pre adj r-loc-2-2 r-loc-1-2 r-up) (taken-atom-3 action-left pre adj l-loc-1-2 l-loc-1-1 l-left) (taken-atom-3 action-right pre adj r-loc-2-2 r-loc-1-2 r-up)
   goals met: 6 of 22
12. (take-atom-3 pre adj l-loc-2-2 l-loc-2-1 l-left r-loc-2-1 r-loc-1-1 r-up)
   added: (processed-atom-3 action-left pre adj l-loc-2-2 l-loc-2-1 l-left) (processed-atom-3 action-right pre adj r-loc-2-1 r-loc-1-1 r-up) (taken-atom-3 action-left pre adj l-loc-2-2 l-loc-2-1 l-left) (taken-atom-3 action-right pre adj r-loc-2-1 r-loc-1-1 r-up)
   goals met: 8 of 22
13. (take-atom-1 del at l-loc-1-1 r-loc-1-2)
   added: (processed-atom-1 action-left del at l-loc-1-1) (processed-atom-1 action-right del at r-loc-1-2) (taken-atom-1 action-left del at l-loc-1-1) (taken-atom-1 action-right del at r-loc-1-2)
   goals met: 10 of 22
14. (take-atom-1 pre at l-loc-1-1 r-loc-1-2)
   added: (processed-atom-1 action-left pre at l-loc-1-1) (processed-atom-1 action-right pre at r-loc-1-2) (taken-atom-1 action-left pre at l-loc-1-1) (taken-atom-1 action-right pre at r-loc-1-2)
   goals met: 12 of 22
15. (take-atom-3 pre adj l-loc-1-1 l-loc-1-2 l-right r-loc-1-2 r-loc-2-2 r-down)
   added: (processed-atom-3 action-left pre adj l-loc-1-1 l-loc-1-2 l-right) (processed-atom-3 action-right pre adj r-loc-1-2 r-loc-2-2 r-down) (taken-atom-3 action-left pre adj l-loc-1-1 l-loc-1-2 l-right) (taken-atom-3 action-right pre adj r-loc-1-2 r-loc-2-2 r-down)
   goals met: 14 of 22
16. (take-atom-3 pre adj l-loc-2-1 l-loc-1-1 l-up r-loc-1-1 r-loc-1-2 r-right)
   added: (processed-atom-3 action-left pre adj l-loc-2-1 l-loc-1-1 l-up) (processed-atom-3 action-right pre adj r-loc-1-1 r-loc-1-2 r-right) (taken-atom-3 action-left pre adj l-loc-2-1 l-loc-1-1 l-up) (taken-atom-3 action-right pre adj r-loc-1-1 r-loc-1-2 r-right)
   goals met: 16 of 22
17. (take-atom-1 add at l-loc-1-2 r-loc-2-2)
   added: (processed-atom-1 action-left add at l-loc-1-2) (processed-atom-1 action-right add at r-loc-2-2) (taken-atom-1 action-left add at l-loc-1-2) (taken-atom-1 action-right add at r-loc-2-2)
   goals met: 18 of 22
18. (take-atom-3 pre adj l-loc-2-2 l-loc-1-2 l-up r-loc-2-1 r-loc-2-2 r-right)
   added: (processed-atom-3 action-left pre adj l-loc-2-2 l-loc-1-2 l-up) (processed-atom-3 action-right pre adj r-loc-2-1 r-loc-2-2 r-right) (taken-atom-3 action-left pre adj l-loc-2-2 l-loc-1-2 l-up) (taken-atom-3 action-right pre adj r-loc-2-1 r-loc-2-2 r-right)
   goals met: 20 of 22
19. (take-atom-3 pre adj l-loc-2-1 l-loc-2-2 l-right r-loc-1-1 r-loc-2-1 r-down)
   added: (processed-atom-3 action-left pre adj l-loc-2-1 l-loc-2-2 l-right) (processed-atom-3 action-right pre adj r-loc-1-1 r-loc-2-1 r-down) (taken-atom-3 action-left pre adj l-loc-2-1 l-loc-2-2 l-right) (taken-atom-3 action-right pre adj r-loc-1-1 r-loc-2-1 r-down)
   goals met: 22 of 22
